# Libraries

In [1]:
import pandas as pd
import numpy as np

# Dataset

In [2]:
data = pd.read_csv("https://raw.githubusercontent.com/lucasquemelli/fundamentos_programacao/main/dataset/aula_1.csv")
data

       id first_name  gender  age  married  recently_bought
0       1    Kynthia  Female   59    False             True
1       2     Calley  Female   17    False            False
2       3    Therese    Male   60    False            False
3       4         Ag    Male   21    False            False
4       5    Chrissy    Male   26     True            False
..    ...        ...     ...  ...      ...              ...
995   996      Kermy  Female   78    False            False
996   997       Shem    Male   70    False            False
997   998      Jerad    Male   61    False             True
998   999     Pierce  Female   22    False            False
999  1000     Austin    Male   54     True             True

[1000 rows x 6 columns]

In [3]:
data.sample(5)

      id first_name  gender  age  married  recently_bought
912  913   Nicolais    Male   32    False             True
128  129     Tiffie  Female   70    False            False
548  549     Sawyer    Male   18    False             True
203  204        Ron    Male   77    False             True
814  815        Ree    Male   69    False             True

# Problemas

1. Selecionar clientes entre 18 e 65 anos.

In [4]:
data[(data['age']>=18) & (data['age']<=65)]

       id first_name  gender  age  married  recently_bought
0       1    Kynthia  Female   59    False             True
2       3    Therese    Male   60    False            False
3       4         Ag    Male   21    False            False
4       5    Chrissy    Male   26     True            False
5       6      Karel  Female   59    False            False
..    ...        ...     ...  ...      ...              ...
991   992    Gabrila    Male   45    False            False
993   994  Theodosia  Female   18     True            False
997   998      Jerad    Male   61    False             True
998   999     Pierce  Female   22    False            False
999  1000     Austin    Male   54     True             True

[738 rows x 6 columns]

2. Selecionar os clientes que são mulheres.

In [5]:
data[data['gender']=="Female"]

      id first_name  gender  age  married  recently_bought
0      1    Kynthia  Female   59    False             True
1      2     Calley  Female   17    False            False
5      6      Karel  Female   59    False            False
7      8    Charley  Female   60    False             True
8      9    Gisella  Female   59    False            False
..   ...        ...     ...  ...      ...              ...
990  991       Asia  Female   73    False             True
993  994  Theodosia  Female   18     True            False
994  995       Dita  Female   79    False            False
995  996      Kermy  Female   78    False            False
998  999     Pierce  Female   22    False            False

[496 rows x 6 columns]

3. Selecionar os clientes que são homens e que são casados, ou os homens que não são casados, mas que compraram na loja recentemente.

In [6]:
data[(data['gender']=="Male") & (data['married']==True)]

       id first_name gender  age  married  recently_bought
4       5    Chrissy   Male   26     True            False
6       7   Gustavus   Male   30     True             True
17     18     Simeon   Male   73     True             True
19     20    Maynord   Male   29     True             True
21     22    Imogene   Male   64     True            False
..    ...        ...    ...  ...      ...              ...
973   974    Maressa   Male   59     True             True
974   975      Fanny   Male   45     True             True
976   977    Felizio   Male   38     True             True
981   982     Horten   Male   41     True             True
999  1000     Austin   Male   54     True             True

[260 rows x 6 columns]

In [7]:
data[(data['gender']=="Male") & (data['married']==False) & (data['recently_bought']==True)]

      id   first_name gender  age  married  recently_bought
11    12  Constantine   Male   34    False             True
25    26       Farlee   Male   66    False             True
26    27     Blakelee   Male   68    False             True
28    29       Maudie   Male   65    False             True
29    30     Giordano   Male   78    False             True
..   ...          ...    ...  ...      ...              ...
975  976          Web   Male   72    False             True
983  984       Dulcea   Male   53    False             True
986  987       Reagen   Male   30    False             True
992  993       Wynnie   Male   15    False             True
997  998        Jerad   Male   61    False             True

[131 rows x 6 columns]

In [8]:
data[((data['gender']=="Male") & (data['married']==True)) | ((data['gender']=="Male") & (data['married']==False) & (data['recently_bought']==True))]

       id   first_name gender  age  married  recently_bought
4       5      Chrissy   Male   26     True            False
6       7     Gustavus   Male   30     True             True
11     12  Constantine   Male   34    False             True
17     18       Simeon   Male   73     True             True
19     20      Maynord   Male   29     True             True
..    ...          ...    ...  ...      ...              ...
983   984       Dulcea   Male   53    False             True
986   987       Reagen   Male   30    False             True
992   993       Wynnie   Male   15    False             True
997   998        Jerad   Male   61    False             True
999  1000       Austin   Male   54     True             True

[391 rows x 6 columns]

# Condicionais

In [9]:
for index, row in data.iterrows():
    if(row['age'] >= 18):
        print("Maior que 18")
        
    else:
        print("Menor que 18")
        
    break

Maior que 18

In [10]:
for index, row in data.iterrows():
    print(index)
    break

0

In [11]:
for index, row in data.iterrows():
    print(row)
    break

id                       1
first_name         Kynthia
gender              Female
age                     59
married              False
recently_bought       True
Name: 0, dtype: object

## Resolvendo os três problemas anteriores com condicionais

In [12]:
mulheres = []
homens = []

for index, row in data.iterrows():
    if (row['age'] >= 18):
        if (row['age'] <= 65):
            if (row['gender'] == 'Female'):
                mulheres.append(row)
            else:
                if (row['married'] == True):
                    homens.append(row)
                elif (row['recently_bought'] == True):
                    homens.append(row)

In [13]:
mulheres[0:5]

[id                       1
 first_name         Kynthia
 gender              Female
 age                     59
 married              False
 recently_bought       True
 Name: 0, dtype: object,
 id                      6
 first_name          Karel
 gender             Female
 age                    59
 married             False
 recently_bought     False
 Name: 5, dtype: object,
 id                       8
 first_name         Charley
 gender              Female
 age                     60
 married              False
 recently_bought       True
 Name: 7, dtype: object,
 id                       9
 first_name         Gisella
 gender              Female
 age                     59
 married              False
 recently_bought      False
 Name: 8, dtype: object,
 id                     10
 first_name          Renee
 gender             Female
 age                    32
 married              True
 recently_bought      True
 Name: 9, dtype: object]

In [14]:
homens[0:5]

[id                       5
 first_name         Chrissy
 gender                Male
 age                     26
 married               True
 recently_bought      False
 Name: 4, dtype: object,
 id                        7
 first_name         Gustavus
 gender                 Male
 age                      30
 married                True
 recently_bought        True
 Name: 6, dtype: object,
 id                          12
 first_name         Constantine
 gender                    Male
 age                         34
 married                  False
 recently_bought           True
 Name: 11, dtype: object,
 id                      20
 first_name         Maynord
 gender                Male
 age                     29
 married               True
 recently_bought       True
 Name: 19, dtype: object,
 id                      22
 first_name         Imogene
 gender                Male
 age                     64
 married               True
 recently_bought      False
 Name: 21, dtype: object]

# Problema

Em uma empresa trabalham 03 pessoas: Alice, Clara e Bianca. As três têm gostos de gênero de filmes distintos. Uma delas gosta de terror, outra gosta de ação e a outra gosta de romance. As três realizam trabalhos distintos. Uma delas Recupera os Dados, a outra faz EDA e a outra monta modelos de ML. 

- A pessoa que gosta de filmes de terror disse: não monto modelos de ML nem Recupero Dados.

- A pessoa que gosta de filmes de ação disse: meu nome não é Clara nem Bianca.

- A pessoa que gosta de filmes de romance disse: nem eu e nem Clara montamos modelos de ML.

Qual o trabalho de cada pessoa?

In [15]:
dataset = {'Nome': ["Alice", "Clara", "Bianca"], 'Genero_Filme': ["x", "x", "x"], 'Trabalho': ["x", "x", "x"]}
df = pd.DataFrame(dataset)
df

     Nome Genero_Filme Trabalho
0   Alice            x        x
1   Clara            x        x
2  Bianca            x        x

In [16]:
df.loc[0, 'Genero_Filme'] = "ação"
df.loc[0, 'Trabalho'] = "ML"
df.loc[2, 'Genero_Filme'] = "romance"
df

     Nome Genero_Filme Trabalho
0   Alice         ação       ML
1   Clara            x        x
2  Bianca      romance        x

In [17]:
df.loc[1, 'Genero_Filme'] = "terror"
df

     Nome Genero_Filme Trabalho
0   Alice         ação       ML
1   Clara       terror        x
2  Bianca      romance        x

In [18]:
df.loc[1, 'Trabalho'] = "EDA"
df

     Nome Genero_Filme Trabalho
0   Alice         ação       ML
1   Clara       terror      EDA
2  Bianca      romance        x

In [19]:
df.loc[2, 'Trabalho'] = "Rec"
df

     Nome Genero_Filme Trabalho
0   Alice         ação       ML
1   Clara       terror      EDA
2  Bianca      romance      Rec

# Problema

Escreva uma aplicação que recebe três números e retorna a soma deles. Porém, se houver números repetidos, o valor dos números repetidos não é contabilizado.

Por exemplo, na entrada (1, 2, 3) a soma é 6, na entrada (3, 2, 3) a soma é 2 e na entrada (3, 3, 3) a soma é 0.

In [20]:
def digite_numero():
    a = int(input("Digite o primeiro número: "))
    b = int(input("\nDigite o segundo número: "))
    c = int(input("\nDigite o terceiro número: "))
    
    return a, b, c

def retorna_soma(a, b, c):
    if ((a != b) & (a != c) & (b != c)):
        z = a + b + c
    elif ((a == b) & (a != c) & (b != c)):
        z = c
    elif ((a == c) & (a != b) & (b != c)):
        z = b
    elif ((b == c) & (a != b) & (a != c)):
        z = a
    else:
        z = 0
    print(f"\nA soma é: {z}.")
    
if __name__ == '__main__':
    a, b, c = digite_numero()
    
    retorna_soma(a, b, c)

Digite o primeiro número: 3

Digite o segundo número: 3

Digite o terceiro número: 3

A soma é: 0.

# Exercício

Em uma escola estudam quatro amigas: Raquel, Vivian, Bruna e Ana. Em um dia ensolarado, elas se reuniram para passear em um parque. Cada uma delas utilizou uma camiseta de cor diferente: Branco, Azul, Amarelo e Verde. Além disso, cada uma passou um protetor solar com fator de proteção (FPS) diferente. Cada uma delas tem um animal de estimação diferente e gosta de um suco diferente, além de terem idades diferentes. Todas elas sentaram em um banco de quatro lugares, cada uma ocupando um lugar diferente. 

- Na terceira posição do banco está a garota que tem o cachorro. Quem tem um peixe está em uma das pontas do banco. A garota que tem um gato está na primeira posição do banco. 

- Ana usou o protetor solar de FPS 50. Na segunda posição está a garota que usou protetor solar com FPS 55. A garota mais nova está ao lado da que usa protetor solar de menor FPS. 

- Quem gosta de suco de morango está na quarta posição do banco. A garota que gosta de suco de Maracujá está ao lado da que tem Pássaros. A garota que gosta de suco de Limão está ao lado da que gosta de suco de Maracujá. Quem gosta de suco de Laranja está em uma das pontas.

- A garota de camiseta Azul está em algum lugar à esquerda da garota que tem 9 anos. A garota de 8 anos está na quarta posição. A garota de 11 anos está em uma das pontas. 

- Vivian tem Pássaros. 

- Raquel está na primeira posição.

- A garota de camiseta Verde está na quarta posição do banco.

- A garota de camiseta Branca está em uma das pontas.

- A garota de 10 anos está ao lado da garota de 11 anos.

- A garota que usou protetor solar de FPS 40 gosta de suco de Maracujá.

- A garota que usou protetor solar de FPS 45 está em uma das pontas do banco. 

- Bruna tem cachorros.

Qual a característica (cor da camiseta, animal de estimação, protetor solar, suco que gosta, nome e idade) de cada uma das garotas?

In [21]:
dataset = {'posicao_banco': ["primeira", "segunda", "terceira", "quarta"], 'cor_camiseta': ["x", "x", "x", "x"], 'animal_estimacao': ["x", "x", "x", "x"], 'protetor_solar': ["x", "x", "x", "x"], 'suco': ["x", "x", "x", "x"], 'nome': ["x", "x", "x", "x"], 'idade': ["x", "x", "x", "x"]}
df = pd.DataFrame(dataset)
df

  posicao_banco cor_camiseta animal_estimacao protetor_solar suco nome idade
0      primeira            x                x              x    x    x     x
1       segunda            x                x              x    x    x     x
2      terceira            x                x              x    x    x     x
3        quarta            x                x              x    x    x     x

In [22]:
df.loc[2, 'animal_estimacao'] = "cachorro"
df.loc[0, 'animal_estimacao'] = "gato"
df.loc[3, 'animal_estimacao'] = "peixe"
df

  posicao_banco cor_camiseta animal_estimacao protetor_solar suco nome idade
0      primeira            x             gato              x    x    x     x
1       segunda            x                x              x    x    x     x
2      terceira            x         cachorro              x    x    x     x
3        quarta            x            peixe              x    x    x     x

In [23]:
df.loc[1, 'protetor_solar'] = "FPS 55"
df

  posicao_banco cor_camiseta animal_estimacao protetor_solar suco nome idade
0      primeira            x             gato              x    x    x     x
1       segunda            x                x         FPS 55    x    x     x
2      terceira            x         cachorro              x    x    x     x
3        quarta            x            peixe              x    x    x     x

In [24]:
df.loc[3, 'suco'] = "morango"
df.loc[1, 'animal_estimacao'] = "passaros"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,x,gato,x,x,x,x
1,segunda,x,passaros,FPS 55,x,x,x
2,terceira,x,cachorro,x,x,x,x
3,quarta,x,peixe,x,morango,x,x

In [25]:
df.loc[0, 'suco'] = "laranja"
df.loc[2, 'suco'] = "maracuja"
df.loc[1, 'suco'] = "limao"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,x,gato,x,laranja,x,x
1,segunda,x,passaros,FPS 55,limao,x,x
2,terceira,x,cachorro,x,maracuja,x,x
3,quarta,x,peixe,x,morango,x,x

In [26]:
df.loc[3, 'idade'] = 8
df.loc[0, 'idade'] = 11
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,x,gato,x,laranja,x,11
1,segunda,x,passaros,FPS 55,limao,x,x
2,terceira,x,cachorro,x,maracuja,x,x
3,quarta,x,peixe,x,morango,x,8

In [27]:
df.loc[1, 'nome'] = "Vivian"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,x,gato,x,laranja,x,11
1,segunda,x,passaros,FPS 55,limao,Vivian,x
2,terceira,x,cachorro,x,maracuja,x,x
3,quarta,x,peixe,x,morango,x,8

In [28]:
df.loc[0, 'nome'] = "Raquel"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,x,gato,x,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,x
2,terceira,x,cachorro,x,maracuja,x,x
3,quarta,x,peixe,x,morango,x,8

In [29]:
df.loc[3, 'cor_camiseta'] = "verde"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,x,gato,x,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,x
2,terceira,x,cachorro,x,maracuja,x,x
3,quarta,verde,peixe,x,morango,x,8

In [30]:
df.loc[0, "cor_camiseta"] = "branca"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,branca,gato,x,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,x
2,terceira,x,cachorro,x,maracuja,x,x
3,quarta,verde,peixe,x,morango,x,8

In [31]:
df.loc[1, 'idade'] = 10
df.loc[2, 'idade'] = 9
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,branca,gato,x,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,10
2,terceira,x,cachorro,x,maracuja,x,9
3,quarta,verde,peixe,x,morango,x,8

In [32]:
df.loc[2, 'protetor_solar'] = "FPS 40"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,branca,gato,x,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,10
2,terceira,x,cachorro,FPS 40,maracuja,x,9
3,quarta,verde,peixe,x,morango,x,8

In [33]:
df.loc[2, 'nome'] = "Bruna"
df.loc[3, 'nome'] = "Ana"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,branca,gato,x,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,10
2,terceira,x,cachorro,FPS 40,maracuja,Bruna,9
3,quarta,verde,peixe,x,morango,Ana,8

In [34]:
df.loc[3, 'protetor_solar'] = "FPS 50"
df.loc[0, 'protetor_solar'] = "FPS 45"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,branca,gato,FPS 45,laranja,Raquel,11
1,segunda,x,passaros,FPS 55,limao,Vivian,10
2,terceira,x,cachorro,FPS 40,maracuja,Bruna,9
3,quarta,verde,peixe,FPS 50,morango,Ana,8

In [35]:
df.loc[1, 'cor_camiseta'] = "azul"
df.loc[2, 'cor_camiseta'] = "amarelo"
df

,posicao_banco,cor_camiseta,animal_estimacao,protetor_solar,suco,nome,idade
0,primeira,branca,gato,FPS 45,laranja,Raquel,11
1,segunda,azul,passaros,FPS 55,limao,Vivian,10
2,terceira,amarelo,cachorro,FPS 40,maracuja,Bruna,9
3,quarta,verde,peixe,FPS 50,morango,Ana,8

#### Outra forma de criar tabelas no Python:

| Caracteristicas x Posicao | Posicao 1 | Posicao 2 | Posicao 3 | Posicao 4 |
|:-------------------------:|:---------:|:---------:|:---------:|:---------:|
| Nome | Raquel | Vivian | Bruna | Ana |
| Pet | Gato | Passaros | Cachorro | Peixe |
| Suco | Laranja | Limao | Maracuja | Morango |
| Protetor | 45 | 55 | 40 | 50 |
| Camiseta | Branca | Azul | Amarelo | Verde |
| Idade | 11 | 10 | 9 | 8 |

# Tipos de comentários

### Documentação

In [36]:
""" Comentário do tipo documentação. """

' Comentário do tipo documentação. '

### Comentário de linha

In [37]:
a = 5 + 1 # soma igual a 6

### Comentário do tipo bloco

In [38]:
# Este é um exemplo de comentário do
# tipo bloco. Cada linha contém um 
# símbolo hashtag separado por um 
# espaço do conteúdo que desejamos 
# escrever

# Conversão do tipo de variáveis

#### String do tipo caracter para inteiro

In [39]:
nome = 'Pedro'
nome_convertido = int(nome)
nome_convertido

ValueError: invalid literal for int() with base 10: 'Pedro'

Não é possível converter uma string para inteiro, como visto acima.

#### String numérica para inteiro

In [40]:
idade = '32'
idade_convertida = int(idade)
idade_convertida

32

Por mais que estejamos atribuindo uma string à variável "idade", o conteúdo é similar a um valor inteiro, então o computador faz a conversão.

In [41]:
type(idade_convertida)

int

#### String numérica para float

In [42]:
idade = '32'
idade_convertida = float(idade)
idade_convertida

32.0

In [43]:
type(idade_convertida)

float

O mesmo ocorre para a conversão de uma string - com característica numérica - para um número real.

#### Inteiro para string

In [44]:
idade = 32
idade_convertida = str(idade)
idade_convertida

'32'

In [45]:
type(idade_convertida)

str

Qualquer conteúdo poder convertido para string.

# Veracidade no Python

O Python entende uma série de índices booleanos como falsos. Para podermos tomar cuidado ao usá-los, segue abaixo uma lista de booleanos considerados falsos.

In [59]:
print(f"A função sem parâmetro retorna: {bool()}.")
print(f"A função com aspas como parâmetro retorna: {bool('')}.")
print(f"A função com zero inteiro como parâmetro retorna: {bool(0)}.")
print(f"A função com zero real como parâmetro retorna: {bool(0.0)}.")
print(f"A função com uma lista vazia como parâmetro retorna: {bool([])}.")
print(f"A função com um dicionário vazio como parâmetro retorna: {bool({})}.")
print(f"A função com 'None' como parâmetro retorna: {bool(None)}.")

A função sem parâmetro retorna: False.
A função com aspas como parâmetro retorna: False.
A função com zero inteiro como parâmetro retorna: False.
A função com zero real como parâmetro retorna: False.
A função com uma lista vazia como parâmetro retorna: False.
A função com um dicionário vazio como parâmetro retorna: False.
A função com 'None' como parâmetro retorna: False.

Resumidamente, o Python entende tudo que não tem conteúdo como falso. Por outro, ele também entende tudo que tem conteúdo como verdadeiro.

# Leitura e escrita básica

A maneira mais básica de ler algo digitado pelo usuário, em Python, é utilizando a função *input*.

In [60]:
dado_inserido = input("Digite a sua idade: ")

Digite a sua idade: 28

In [61]:
dado_inserido

'28'

Como visto acima, tudo que for lido pela função *input* será entendido como *str*. Para converter o conteúdo digitado, fazemos:

In [62]:
dado_inserido = int(input("Digite a sua idade: "))

Digite a sua idade: 28

In [63]:
dado_inserido

28

In [64]:
altura_inserida = float(input("Digite a sua altura em metros: "))

Digite a sua altura em metros: 1.70

In [65]:
type(altura_inserida)

float

Para leitura de dados do usuário, então, usamos a função *input*. Para a escrita de dados na tela, usamos a função *print*.

# Erros mais comuns

- Python é Case Sensitive:
nome != Nome.

- Erros de digitação: escrita errada, tais como erros ortográficos, letra a menos ou a mais, etc.

- Palavras reservadas: palavras que o compilador utiliza para alguma tarefa. 
Ex: if, True, False, int, list, etc. As palavras reservadas são destacadas, automaticamente, pela cor verde no Python.

Se usarmos o sinal *underscore* na frente ou atrás da palavra reservada, ele se torna uma palavra não reservada. Contudo, devemos tomar cuidado com o sinal na frente da variável, porque remete à variável privada.

- Identação: necessidade ou ausência de espaços. Obs: o Python aceita, quando há apenas uma linha de comando, identação fora da regra:

In [68]:
nome = "Lucas"

if (nome): print(nome)

Lucas

In [70]:
if (nome):
 print(nome)

Lucas

In [71]:
if (nome):
  print(nome)

Lucas

In [72]:
if (nome):
   print(nome)

Lucas

Ainda sobre a identação, quando não padronizada, ela pode colocar o que está fora do 'if' no mesmo nível hierárquico do 'if'. Assim, o Python executará ou não o que está dentro do 'if' (a depender se a condição for atendida) e obrigatoriamente executará tudo que estiver fora, ou seja, no mesmo nível hierárquico do 'if'. Exemplo:

In [74]:
if (False):
    print("Olá!")
    print("Tudo bem?")
print("Fim.")

Fim.

In [75]:
if (True):
    print("Olá!")
    print("Tudo bem?")
print("Fim.")

Olá!
Tudo bem?
Fim.

Note que o comando contendo a string "Fim." foi executado todas as vezes. A diferença foi ao executar o que está dentro do 'if', a partir das condições True ou False.

# Problema

Codifique uma aplicação que receba como entrada dois números reais. A aplicação deve receber também um terceiro caractere, que deve ser um sinal de operação (+, -, * ou /). Em seguida, a aplicação deve fazer a operação e exibir o valor na tela. 

Em caso de divisão, se o segundo número recebido for 0, então o usuário deve receber a mensagem: "Impossível dividir um número por zero".

In [98]:
num1 = float(input("Informe o primeir valor: "))
num2 = float(input("Informe o segundo valor: "))
sinal = input("Informe o sinal da operação (+, -, * ou /): ")


if ((sinal == '/') and (num2 == 0)):
    while (num2 == 0):
        print("\nImpossível dividir um número por zero!")
        num2 = float(input("Informe outro valor em vez de 0: "))
        
        if (num2 != 0):
            print(f"O resultado da operação é: {num1/num2}.")
        
elif ((sinal == '/') and (num2 != 0)):
    print(f"\nO resultado da operação é: {num1/num2}.")
    
elif (sinal == '+'):
    print(f"\nO resultado da operação é: {num1 + num2}.")

elif (sinal == '-'):
    print(f"\nO resultado da operação é: {num1 - num2}.")
    
else:
    print(f"\nO resultado da operação é: {num1 * num2}.")

Informe o primeir valor: 10
Informe o segundo valor: 0
Informe o sinal da operação (+, -, * ou /): /

Impossível dividir um número por zero!
Informe outro valor em vez de 0: 0

Impossível dividir um número por zero!
Informe outro valor em vez de 0: 0

Impossível dividir um número por zero!
Informe outro valor em vez de 0: 0

Impossível dividir um número por zero!
Informe outro valor em vez de 0: 2.5
O resultado da operação é: 4.0.